Repository: math65/dsmaccess
Catalog: dsmaccess/Localizable.xcstrings
Source language: en
Languages: fr

# containers.project.action.build.success
source: Project rebuilt: %@
fr: Projet reconstruit : %@

# containers.project.action.clean.success
source: Project cleaned: %@
fr: Projet nettoyé : %@

# containers.project.delete.success
source: Project deleted: %@
fr: Projet supprimé : %@

# containers.project.summary.count
source: %1$lld projects, %2$lld running
fr: %1$lld projets, %2$lld en fonctionnement

# containers.project.clean.confirm.title
source: Clean “%@”?
fr: Nettoyer « %@ » ?

# containers.project.clean.confirm.message
source: The containers of “%@” will be stopped and removed. The compose file and its folder are kept, and the project can be started again.
fr: Les conteneurs de « %@ » seront arrêtés puis supprimés. Le fichier compose et son dossier sont conservés, et le projet peut être redémarré.

# containers.project.delete.confirm.title
source: Delete “%@”?
fr: Supprimer « %@ » ?

# containers.project.delete.confirm.message
source: The project “%@” and its containers will be removed from Container Manager. This cannot be undone from this app.
fr: Le projet « %@ » et ses conteneurs seront supprimés de Container Manager. Cette action ne peut pas être annulée depuis cette app.

# containers.project.report.success
source: %1$@ finished for %2$@
fr: %1$@ terminé pour %2$@

# containers.project.report.failure
source: %1$@ failed for %2$@, exit code %3$lld
fr: %1$@ a échoué pour %2$@, code de sortie %3$lld

# containers.project.report.list_label
source: Output of %1$@ for %2$@
fr: Sortie de %1$@ pour %2$@

# containers.project.report.empty.title
source: No output
fr: Aucune sortie

# containers.project.report.empty.description
source: docker-compose finished without printing anything.
fr: docker-compose s'est terminé sans rien afficher.

# containers.project.detail.title
source: Project %@
fr: Projet %@

# containers.project.detail.portal
source: Web portal
fr: Portail web

# containers.project.detail.compose
source: Compose file
fr: Fichier compose

# containers.project.detail.compose_loading
source: Loading the compose file
fr: Chargement du fichier compose

# containers.image.loading
source: Loading images…
fr: Chargement des images…

# containers.image.empty.title
source: No images
fr: Aucune image

# containers.image.empty.description
source: No container image is stored on this NAS.
fr: Aucune image de conteneur n'est stockée sur ce NAS.

# containers.image.column.tag
source: Tag
fr: Identification

# containers.image.column.update
source: Update
fr: Mise à jour

# containers.image.update.available
source: Update available
fr: Mise à jour disponible

# containers.image.update.up_to_date
source: Up to date
fr: À jour

# containers.image.action.pull
source: Download an image…
fr: Télécharger une image…

# containers.image.action.pull.hint
source: Downloads an image from the registry to the NAS.
fr: Télécharge une image depuis le registre vers le NAS.

# containers.image.action.delete.hint
source: Removes the selected image from the NAS.
fr: Supprime l'image sélectionnée du NAS.

# containers.image.pull.title
source: Download an image
fr: Télécharger une image

# containers.image.pull.repository
source: Image name
fr: Nom de l'image

# containers.image.pull.tag
source: Tag (latest if empty)
fr: Identification (latest si vide)

# containers.image.pull.registry_note
source: The image will be downloaded from %@.
fr: L'image sera téléchargée depuis %@.

# containers.image.pull.cancel.hint
source: Closes without downloading anything.
fr: Ferme sans rien télécharger.

# containers.image.pull.in_progress
source: Downloading %@…
fr: Téléchargement de %@…

# containers.image.pull.progress
source: Downloading %1$@: %2$@
fr: Téléchargement de %1$@ : %2$@

# containers.image.pull.success
source: Image downloaded: %@
fr: Image téléchargée : %@

# containers.image.delete.confirm.title
source: Delete “%@”?
fr: Supprimer « %@ » ?

# containers.image.delete.confirm.message
source: The image “%@” will be removed from the NAS. A container that still needs it will no longer find it. This cannot be undone; the image can be downloaded again.
fr: L'image « %@ » sera supprimée du NAS. Un conteneur qui en a encore besoin ne la trouvera plus. Cette action ne peut pas être annulée ; l'image peut être téléchargée de nouveau.

# containers.image.delete.success
source: Image deleted: %@
fr: Image supprimée : %@

# containers.network.loading
source: Loading networks…
fr: Chargement des réseaux…

# containers.network.empty.title
source: No networks
fr: Aucun réseau

# containers.network.empty.description
source: Container Manager did not return any network.
fr: Container Manager n'a renvoyé aucun réseau.

# containers.network.column.driver
source: Driver
fr: Pilote

# containers.network.column.subnet
source: Subnet
fr: Sous-réseau

# containers.network.column.gateway
source: Gateway
fr: Passerelle

# containers.network.column.containers
source: Containers
fr: Conteneurs

# containers.network.summary.count
source: %lld networks
fr: %lld réseaux

# containers.project.action.details
source: Project details
fr: Détails du projet

# containers.project.action.build.hint
source: Recreates the containers of the project from its compose file.
fr: Recrée les conteneurs du projet à partir de son fichier compose.

# containers.project.status.build_failed
source: Build failed
fr: Échec de construction

# containers.project.action.failed
source: %1$@ failed for %2$@
fr: %1$@ a échoué pour %2$@

# containers.log.search.prompt
source: Search the log
fr: Rechercher dans le journal

# containers.log.column.event
source: Event
fr: Événement

# containers.log.module_empty.title
source: No events
fr: Aucun événement

# containers.log.module_empty.description
source: Container Manager has not recorded any event matching these filters.
fr: Container Manager n'a enregistré aucun événement correspondant à ces filtres.

# containers.log.clear
source: Clear the log
fr: Effacer le journal

# containers.log.clear.hint
source: Removes every event from Container Manager's log.
fr: Supprime tous les événements du journal de Container Manager.

# containers.log.clear.success
source: Log cleared
fr: Journal effacé

# containers.log.clear.confirm.title
source: Clear the Container Manager log?
fr: Effacer le journal de Container Manager ?

# containers.log.clear.confirm.message
source: Every recorded event will be removed for all containers. This cannot be undone; export the log first to keep a copy.
fr: Tous les événements enregistrés seront supprimés, pour tous les conteneurs. Cette action ne peut pas être annulée ; exportez d'abord le journal pour en garder une copie.

# containers.log.refresh.hint
source: Reloads the log from the NAS.
fr: Recharge le journal depuis le NAS.

# containers.log.summary.count
source: %lld events
fr: %lld événements

# containers.log.summary.partial
source: %1$lld events shown of %2$lld
fr: %1$lld événements affichés sur %2$lld

# containers.image.action.upgrade
source: Update
fr: Mettre à jour

# containers.image.action.upgrade.hint
source: Downloads the newer build of the selected image. Containers keep the old build until they are recreated.
fr: Télécharge la nouvelle version de l'image sélectionnée. Les conteneurs gardent l'ancienne version tant qu'ils ne sont pas recréés.

# containers.image.upgrade.in_progress
source: Updating %@…
fr: Mise à jour de %@…

# containers.image.upgrade.success
source: Image updated: %@
fr: Image mise à jour : %@

# containers.image.prune
source: Delete unused images
fr: Supprimer les images inutilisées

# containers.image.prune.hint
source: Removes every image no container references.
fr: Supprime toutes les images qu'aucun conteneur n'utilise.

# containers.image.prune.success
source: Unused images deleted
fr: Images inutilisées supprimées

# containers.image.prune.confirm.title
source: Delete every unused image?
fr: Supprimer toutes les images inutilisées ?

# containers.image.prune.confirm.message
source: Every image no container references will be removed from the NAS. This cannot be undone; the images can be downloaded again.
fr: Toutes les images qu'aucun conteneur n'utilise seront supprimées du NAS. Cette action ne peut pas être annulée ; les images peuvent être téléchargées de nouveau.

# containers.action.delete.success
source: Container deleted: %@
fr: Conteneur supprimé : %@

# containers.action.delete.hint
source: Removes the selected container and its settings.
fr: Supprime le conteneur sélectionné et ses réglages.

# containers.delete.confirm.title
source: Delete “%@”?
fr: Supprimer « %@ » ?

# containers.delete.confirm.message
source: The container “%@” will be stopped if needed, then removed with its settings. Data in mounted folders stays on the NAS. This cannot be undone.
fr: Le conteneur « %@ » sera arrêté si besoin, puis supprimé avec ses réglages. Les données des dossiers montés restent sur le NAS. Cette action ne peut pas être annulée.

# containers.detail.processes
source: Processes
fr: Processus

# containers.detail.processes.loading
source: Loading processes…
fr: Chargement des processus…

# containers.detail.processes.empty.title
source: No processes
fr: Aucun processus

# containers.detail.processes.empty.description
source: The NAS did not report any process for this container.
fr: Le NAS n'a signalé aucun processus pour ce conteneur.

# containers.detail.processes.column.command
source: Command
fr: Commande

# containers.detail.processes.table_label
source: Processes of %@
fr: Processus de %@

# containers.tab.registries
source: Registries
fr: Registres

# containers.registry.loading
source: Loading registries…
fr: Chargement des registres…

# containers.registry.column.repository
source: Repository
fr: Dépôt

# containers.registry.column.active
source: In use
fr: Utilisation

# containers.registry.column.account
source: Account
fr: Compte

# containers.registry.status.active
source: In use
fr: Utilisé

# containers.registry.status.inactive
source: Not in use
fr: Non utilisé

# containers.registry.account.none
source: None
fr: Aucun

# containers.registry.action.search
source: Search for an Image…
fr: Rechercher une image…

# containers.registry.action.search.hint
source: Search the active registry for an image
fr: Chercher une image dans le registre utilisé

# containers.registry.action.add
source: Add
fr: Ajouter

# containers.registry.action.add.hint
source: Add a registry
fr: Ajouter un registre

# containers.registry.action.edit.hint
source: Edit the selected registry
fr: Modifier le registre sélectionné

# containers.registry.action.use
source: Use
fr: Utiliser

# containers.registry.action.use.hint
source: Download images from this registry from now on
fr: Télécharger désormais les images depuis ce registre

# containers.registry.action.delete.hint
source: Remove the selected registry
fr: Supprimer le registre sélectionné

# containers.registry.action.in_progress
source: Operation in progress
fr: Opération en cours

# containers.registry.summary.count
source: %lld registries
fr: %lld registres

# containers.registry.summary.count_active
source: %1$lld registries, downloading from %2$@
fr: %1$lld registres, téléchargement depuis %2$@

# containers.registry.add.title
source: Add a Registry
fr: Ajouter un registre

# containers.registry.edit.title
source: Edit Registry
fr: Modifier le registre

# containers.registry.section.credentials
source: Credentials
fr: Identifiants

# containers.registry.field.name
source: Name
fr: Nom

# containers.registry.field.name.hint
source: The name the registry appears under in the list.
fr: Nom sous lequel le registre apparaît dans la liste.

# containers.registry.field.url.hint
source: Address of the registry, such as https://registry.example.com.
fr: Adresse du registre, par exemple https://registry.example.com.

# containers.registry.field.username
source: Username
fr: Nom d’utilisateur

# containers.registry.field.username.hint
source: Leave empty if the registry is public.
fr: Laissez ce champ vide si le registre est public.

# containers.registry.field.password
source: Password
fr: Mot de passe

# containers.registry.field.password.hint
source: Leave empty if the registry is public.
fr: Laissez ce champ vide si le registre est public.

# containers.registry.field.password.hint_edit
source: Fill it in to replace the current password, leave it empty to keep it.
fr: Renseignez ce champ pour remplacer le mot de passe actuel, laissez-le vide pour le conserver.

# containers.registry.field.password.not_readable
source: DSM never returns a stored password, so this field always starts empty.
fr: DSM ne renvoie jamais un mot de passe enregistré : ce champ est donc toujours vide au départ.

# containers.registry.field.trust_certificate
source: Trust self-signed certificates
fr: Faire confiance aux certificats auto-signés

# containers.registry.field.trust_certificate.hint
source: Accepts a certificate the registry signed itself.
fr: Accepte un certificat que le registre a signé lui-même.

# containers.registry.error.name_taken
source: That name is already used by another registry.
fr: Ce nom est déjà utilisé par un autre registre.

# containers.registry.save.in_progress
source: Saving
fr: Enregistrement en cours

# containers.registry.create.success
source: Registry added: %@
fr: Registre ajouté : %@

# containers.registry.create.failed
source: Adding %1$@ failed: %2$@
fr: L’ajout de %1$@ a échoué : %2$@

# containers.registry.edit.success
source: Registry saved: %@
fr: Registre enregistré : %@

# containers.registry.edit.failed
source: Saving %1$@ failed: %2$@
fr: L’enregistrement de %1$@ a échoué : %2$@

# containers.registry.delete.success
source: Registry removed: %@
fr: Registre supprimé : %@

# containers.registry.use.success
source: Images are now downloaded from %@
fr: Les images sont désormais téléchargées depuis %@

# containers.registry.delete.confirm.title
source: Remove “%@”?
fr: Supprimer « %@ » ?

# containers.registry.delete.confirm.message
source: The registry “%@” will be removed from the list. Images already downloaded from it are kept.
fr: Le registre « %@ » sera retiré de la liste. Les images déjà téléchargées depuis ce registre sont conservées.

# containers.registry.delete.confirm.message_active
source: “%@” is the registry images are currently downloaded from. Removing it leaves no registry in use until you choose another one.
fr: « %@ » est le registre depuis lequel les images sont téléchargées. Le supprimer laisse l’application sans registre utilisé jusqu’à ce que vous en choisissiez un autre.

# containers.registry.search.title
source: Search for an Image
fr: Rechercher une image

# containers.registry.search.field
source: Search
fr: Rechercher

# containers.registry.search.field.hint
source: Searches the registry in use. Press Return to run the search.
fr: Cherche dans le registre utilisé. Validez pour lancer la recherche.

# containers.registry.search.action
source: Search
fr: Rechercher

# containers.registry.search.in_progress
source: Searching
fr: Recherche en cours

# containers.registry.search.prompt
source: Enter a keyword to search the registry in use.
fr: Saisissez un mot-clé pour chercher dans le registre utilisé.

# containers.registry.search.results
source: Images found
fr: Images trouvées

# containers.registry.search.column.downloads
source: Downloads
fr: Téléchargements

# containers.registry.search.column.stars
source: Stars
fr: Étoiles

# containers.registry.search.column.official
source: Official
fr: Officielle

# containers.registry.search.official
source: Official
fr: Officielle

# containers.registry.search.select_prompt
source: Select an image to choose its version.
fr: Sélectionnez une image pour choisir sa version.

# containers.registry.search.download
source: Download
fr: Télécharger

# containers.registry.search.download.hint
source: Download the chosen version of this image
fr: Télécharger la version choisie de cette image

# containers.registry.search.download.in_progress
source: Downloading %1$@:%2$@
fr: Téléchargement de %1$@:%2$@

# containers.registry.search.none
source: No image found in %@
fr: Aucune image trouvée dans %@

# containers.registry.search.count
source: %1$lld images found in %2$@
fr: %1$lld images trouvées dans %2$@

# containers.registry.search.count_partial
source: First %1$lld of %2$lld images found in %3$@
fr: Les %1$lld premières images sur %2$lld trouvées dans %3$@

# containers.registry.search.unsupported
source: %@ offers no image search. Enter the image name in the Images tab to download from it.
fr: %@ ne propose pas de recherche d’images. Saisissez le nom de l’image dans l’onglet Images pour télécharger depuis ce registre.

# containers.registry.search.failed
source: Search failed: %@
fr: La recherche a échoué : %@

# containers.registry.tags.loading
source: Loading versions…
fr: Chargement des versions…

# containers.registry.tags.none
source: This registry publishes no version for this image.
fr: Ce registre ne publie aucune version pour cette image.

# containers.registry.tags.failed
source: Could not read the versions of %1$@: %2$@
fr: Impossible de lire les versions de %1$@ : %2$@

# containers.image.action.detail
source: Details
fr: Détails

# containers.image.action.detail.hint
source: Show what the selected image declares
fr: Afficher ce que déclare l’image sélectionnée

# containers.image.detail.loading
source: Loading the image details…
fr: Chargement des détails de l’image…

# containers.image.detail.identifier
source: Identifier
fr: Identifiant

# containers.image.detail.virtual_size
source: Virtual size
fr: Taille virtuelle

# containers.image.detail.author
source: Author
fr: Auteur

# containers.image.detail.docker_version
source: Docker version
fr: Version de Docker

# containers.image.detail.digest
source: Digest
fr: Empreinte

# containers.image.detail.execution
source: Execution
fr: Exécution

# containers.image.detail.entrypoint
source: Entry point
fr: Point d’entrée

# containers.image.detail.command
source: Command
fr: Commande

# containers.image.detail.ports
source: Exposed ports
fr: Ports exposés

# containers.image.detail.ports.none
source: This image exposes no port.
fr: Cette image n’expose aucun port.

# containers.image.detail.volumes.none
source: This image expects no volume.
fr: Cette image n’attend aucun volume.

# containers.image.detail.environment
source: Environment variables
fr: Variables d’environnement

# containers.image.detail.environment.none
source: This image ships with no environment variable.
fr: Cette image ne fournit aucune variable d’environnement.

# containers.image.action.transfer
source: Transfer
fr: Transférer

# containers.image.action.transfer.hint
source: Import an image archive, or export the selected image
fr: Importer une archive d’image, ou exporter l’image sélectionnée

# containers.image.action.export
source: Export
fr: Exporter

# containers.image.action.import
source: Import
fr: Importer

# containers.image.import.from_nas
source: Import from the NAS
fr: Importer depuis le NAS

# containers.image.import.from_mac
source: Import from this Mac…
fr: Importer depuis ce Mac…

# containers.image.archive.folder
source: Folder
fr: Dossier

# containers.image.archive.result
source: Archive to write
fr: Archive à écrire

# containers.image.archive.available
source: Archives in this folder
fr: Archives de ce dossier

# containers.image.archive.loading
source: Looking for archives…
fr: Recherche des archives…

# containers.image.archive.none
source: This folder holds no image archive.
fr: Ce dossier ne contient aucune archive d’image.

# containers.image.archive.working
source: Transfer in progress
fr: Transfert en cours

# containers.image.export.in_progress
source: Exporting %@
fr: Exportation de %@

# containers.image.export.success
source: Image exported to %@
fr: Image exportée vers %@

# containers.image.export.failed
source: Exporting %1$@ failed: %2$@
fr: L’exportation de %1$@ a échoué : %2$@

# containers.image.import.in_progress
source: Importing the image…
fr: Importation de l’image…

# containers.image.import.success
source: Image imported
fr: Image importée

# containers.image.import.failed
source: Importing failed: %@
fr: L’importation a échoué : %@

# containers.image.upload.in_progress
source: Sending the archive…
fr: Envoi de l’archive…

# containers.image.upload.progress
source: Sending the archive: %@
fr: Envoi de l’archive : %@

# containers.image.upload.failed
source: Sending the archive failed: %@
fr: L’envoi de l’archive a échoué : %@
